local addonName, addon = ...

-- 确保addon表存在
if not addon then
    addon = {}
end
addon.BossData = {
    -- 11.0 赛季副本
    ["千丝之城"] = {
        -- BOSS部分
        ["演说者基克斯威兹克"] = {
            order = 1,
            tips = "{rt8}演说者基克斯威兹克{rt8}||开打以BOSS为中心身边出个圈，所有人保持自己在boss圈内，并躲开头前||两个疑之影点名，让开先驱散一个||喧神教化AOE时所有人提前跑位到BOSS头前||||BOSS定期砸地板放黑水需要坦克拉开||圈只会跟BOSS走，坦克不拉走大家只好硬踩黑水了！",
        },
        ["女王之牙"] = {
            order = 2,
            tips = "{rt8}女王之牙{rt8}||打正在攻击的BOSS||P1: 恩格斯攻击，躲各种地板，维克斯释放寒冰镰刀时，两两分散，不要站一条直线，并开减伤应对之后的DEBUFF||P2: 维克斯攻击，点T白圈集中踩，避免倒T；点名紫圈原来人群。",
        },
        ["凝结聚合体"] = {
            order = 3,
            tips = "{rt8}凝结聚合体{rt8}||BOSS召唤黑球从场地边缘飞向BOSS||需要去接球别让BOSS吃球回血||吃到球的队友会染一个DEBUFF需要奶妈刷爆他。",
        },
        ["大捻接师艾佐"] = {
            order = 4,
            tips = "{rt8}大捻接师艾佐{rt8}||BOSS会点名所有人几秒后脚下出软泥||在打死软泥之前无限定身||需要所有人在点名时集合方便速度AOE掉软泥||如果能自己解定身的职业可以无视||否则会一直定身影响后续需要跑位技能的躲避。",
        },
    },

    ["破晨号"] = {
        -- BOSS部分
        ["代言人夏多克朗"] = {
            order = 1,
            tips = "{rt8}代言人夏多克朗{rt8}||打断暗影箭，不要被光束碰到（P1三条P2四条），提前站位||治疗第一时间驱散燃烧之影DEBUFF，然后刷血刷爆吸收盾||中塌缩第一时间去场边放水（点名最远的2个人，看见读条就用位移技能跑）||BOSS放完黑水T注意打断并拉离黑水||BOSS 50% 1%上鸟远离飞船，1%那次可以直接飞往老2小怪",
        },
        ["阿努布伊卡斯"] = {
            order = 2,
            tips = "{rt8}阿努布伊卡斯{rt8}||T卡墙，出现黑圈所有人躲开||对着空旷处放球，避开球正面，球飞得越远伤害越低,治疗注意被球撞的人||出现小怪群控AOE掉||BOSS AOE会越来越痛，规划好减伤和治疗。",
        },
        ["拉夏南"] = {
            order = 3,
            tips = "{rt8}拉夏南{rt8}||P1：躲开地上白圈，绿色点名推波注意人群方向，治疗在AOE时注意抬血，不要猛捶BOSS，第一时间捡炸弹丢BOSS，捡炸弹时注意开减伤，治疗注意抬血||P2转场:直接飞到BOSS场地等，或者吃球跟着BOSS飞||P2:P2增加白圈点名技能，中白圈的跑场地边缘放圈再位移回来，全程BOSS点名非坦队友放绿线||被点名人自己改变站位让毒浪出现在边缘不影响其他队友||场地上出倒计时火药桶需要捡桶丢BOSS脸上炸它||否则桶会爆炸全团AOE||二阶段BOSS离开飞船的时候利用战斗中上鸟功能沿着NPC点亮的悬浮光球追击。",
        },
    },

    ["艾拉-卡拉，回响之城"] = {
        -- BOSS部分
        ["阿瓦诺克斯"] = {
            order = 1,
            tips = "{rt8}阿瓦诺克斯{rt8}||躲开地板，偶尔可以踩一下||三连击时，T注意覆盖减伤||治疗注意留技能给群体AOE||群控减速，并转火小怪||定期召唤小蜘蛛无仇恨追人，需要控住清理。",
        },
        ["阿努布泽克特"] = {
            order = 2,
            tips = "{rt8}阿努布泽克特{rt8}||躲开地上头前地板和会移动的虫群。Boss二阶段会放全场AOE虫群之眼||注意站到boss前面的圈圈里，躲好技能，出去就是死||点名一名队友几秒后会出现一圈小虫群AOE需要离开人群放圈||BOSS读条钻地冲击时，近战远离，躲开戳刺方向，躲开点名留下的蓝圈。",
        },
        ["收割者吉卡塔尔"] = {
            order = 3,
            tips = "{rt8}收割者吉卡塔尔{rt8}||冲击波不友好对人群放||出啥躲啥，被网住就昏迷6秒，不能驱散的||场地边缘出现的小软泥打死会留下黑水||人踩上去会被定身并身下出现一只小软需要打掉才能解除||BOSS引导大招全场吸人时所有人需要主动去踩黑水定身避免被吸入。",
        },
    },
    ["矶石宝库"] = {
        -- BOSS部分
        ["E.D.N.A"] = {
            order = 1,
            tips = "{rt8}E.D.N.A{rt8}||躲开地刺，BOSS读红条时分散，不要中2根，每次打掉2根地刺||T开大减伤吃第一个震地猛击，治疗注意刷T，并在第二个震地猛击前2秒驱散T DEBUFF||BOSS点名三个人放射线,会有箭头指引方向||被点名的人自己调整利用射线把场地上的石头炸掉。",
        },
        ["斯卡莫拉克"] = {
            order = 2,
            tips = "{rt8}斯卡莫拉克{rt8}||安排人逐步每波打1到2个小怪，所有DPS吃球||虚空魔像，场地上召唤的水晶需要打掉||否则BOSS会定期吃掉水晶给自己上很厚的吸收盾||BOSS上盾AOE时开爆发打破盾。",
        },
        ["机械大师"] = {
            order = 3,
            tips = "{rt8}机械大师{rt8}||全场放火阶段有一个方向固定没有火，站在没有火的通风口||打断矮子BOSS所有的熔铁之水||躲开机器人BOSS头前大火球（ZS可以盾反）大火球可以清地上的水||离开中间铁轨，躲开中间的泥头车||在机器人释放解体时，躲冲击波并开技能抬血||其中一人死掉另一人会开始全场持续AOE||需要平衡血量尽量一起死。",
        },
        ["虚空代言人艾里克"] = {
            order = 4,
            tips = "{rt8}虚空代言人艾里克{rt8}||BOSS身边的两个虚空黑门，碰到就秒杀||被BOSS点名持续时间DOT||需要跑去黑门附近就会消失但别碰到黑门||BOSS点名放黑水尽量放边缘免得后期没地方站。",
        },
    },
    ["塞兹仙林的迷雾"] = {
        -- BOSS 部分
        ["英格拉·马洛克"] = {
            order = 1,
            tips = "{rt8}英格拉·马洛克{rt8}||起手先打大个子不要开爆发||DPS 保留爆到大个子变绿||躲开地板技能||注意打断小个子技能。",
        },
        ["唤雾者"] = {
            order = 2,
            tips = "{rt8}唤雾者{rt8}||BOSS 在 70%/40%/10%血量时召唤小怪头顶有类似迷宫的机制。必须找到与众不同的那个并击杀它||分身有AOE技能，没找到正确的分身不要打，打错死了全图爆炸 AOE||躲开闪避球，秒人的||T 注意打断拍拍手技能，只有 T 能断||鬼抓人目标使用位移技能远离狐狸，全队有控制技能减速技能的帮忙控制狐狸，不能羊。",
        },
        ["特雷德奥瓦"] = {
            order = 3,
            tips = "{rt8}特雷德奥瓦{rt8}||70/40BOSS 有护盾，打破护盾并打断 BOSS||躲开旋涡，击杀小怪||如果被连线，彼此远离||酸蚀排放技能开始时不要大距离移动，防止最后满地图绿圈。||被点名向 T 跑，把小怪拉到 T 跟前接怪。",
        },
    },
    ["通灵战潮"] = {
        -- BOSS 部分
        ["凋骨"] = {
            order = 1,
            tips = "{rt8}凋骨{rt8}||将呕吐物对准远离团队的方向||远离被点吐息的目标||杀小怪||躲开地板技能。",
        },
        ["阿玛厄斯"] = {
            order = 2,
            tips = "{rt8}阿玛厄斯{rt8}||打断 BOSS||打断 FS 小怪，聚好小怪快速杀掉||躲避亡者领域||BOSS 定期会吐息冰旋转，DPS N 提前躲避到 BOSS 身后。",
        },
        ["外科医生缝肉"] = {
            order = 3,
            tips = "{rt8}外科医生缝肉{rt8}||中肉钩点名的，站到小怪和 BOSS 中间，让箭头对准 BOSS，读条到 1 的时候闪开||BOSS 被拉下来开爆发||即时 BOSS 不在台上也要用肉钩对准 BOSS 来打断凝视||BOSS 快上台子时中肉钩可提前瞄准台子||上矛。嗜血打 BOSS。",
        },
        ["缚霜者纳尔佐"] = {
            order = 4,
            tips = "{rt8}缚霜者纳尔佐{rt8}|| 躲避漩涡。||如果有人被冰冻，尽快离开他们的圆圈。在大圆圈为空之前不要驱散。圈内有人驱散会传染||如果被传送走，尽快跑下通道开位移技能躲避地图白圈并击杀怪物||完成后点 NPC 上来加 100%暴击 40 秒，50 秒后没上来直接秒杀||当你回来时，站在边缘放置冰块。",
        },
    },
    ["格瑞姆巴托"] = {
        -- BOSS 部分
        ["乌比斯将军"] = {
            order = 1,
            tips = "{rt8}乌比斯将军{rt8}||避开地面上的橙色圆圈。||当房间变成紫色时，寻找安全通道。总共 4 条通道。||放土圈注意不要封路，尽量放边上||三连斩 T 覆盖好减伤",
        },
        ["铸炉之主索朗格斯"] = {
            order = 2,
            tips = "{rt8}铸炉之主索朗格斯{rt8}||拉着靠墙，其他人靠外，中点名注意移动放岩浆||boss 更换武器时，他会造成大量的范围伤害。||第 1 阶段是斧头，所有人把锥形地板火引在一起。||第 2 阶段是双持，坦克克星，对坦克进行大治疗||第 3 阶段是双手锤 - 风筝阶段。||重复。",
        },
        ["达加·燃影者"] = {
            order = 3,
            tips = "{rt8}达加·燃影者{rt8}||第 1 阶段杀死小怪||第 2 阶段杀死小怪并避开旋风（这可能会变得很疯狂，帮助你的治疗，避开障碍物）||暗影烈焰箭尽量断，熵能诅咒能驱就驱||被点名的远离火人，其他人转火减速击杀||P1 平伤，P2 爆发，躲风||Boss 50%倒地",
        },
        ["埃鲁达克"] = {
            order = 4,
            tips = "{rt8}埃鲁达克,地狱公爵{rt8}||避开触手||当房间开始缩小时收缩，但在我们拥有的狭小圆圈内尽可能保持分散。||被点名紫色圈的三个人不要吃二重圈||DK 绿罩，ZS 盾反踩触手，进风眼后被点名的贴边||等 BOSS AOE 结束后，A 掉小怪。",
        },
    },
    ["围攻伯拉勒斯"] = {
        ["“屠夫”血钩"] = {
            order = 1,
            tips = "{rt8}“屠夫”血钩{rt8}||迅速解决自带的小怪后转火 BOSS||撞军火。||避开地板技能。",
        },
        ["恐怖船长洛克伍德"] = {
            order = 2,
            tips = "{rt8}恐怖船长洛克伍德{rt8}||避开地面上的东西。||击杀小怪。||注意给 BOSS 上高额的减速 Dot||当大炮掉落时捡起来并向 boss 开火。",
        },
        ["哈达尔·黑渊"] = {
            order = 3,
            tips = "{rt8}哈达尔·黑渊{rt8}||避开漩涡。||放[潮汐涌动]时，站在雕像的另一侧。坦克被点头前不要面对人群！继续第二波潮水，躲好||近战放水记得给远程留位置，贴雕像放水，躲连续两波海潮，循环到死。",
        },
        ["维克戈斯"] = {
            order = 4,
            tips = "{rt8}维克戈斯{rt8}||先杀攫握恐魔，再杀攻城恐魔。||避开水圈，治疗驱散时要注意！圈里不能有别人。||当触手在平台上被杀死时，跳进大炮并射击 Boss。||在第二个平台上重复此操作。||在船平台上重复此操作。||狐人、地精、侏儒等使用变身玩具，否则桥上会游泳",
        },
    },

    -- 11.1赛季大米副本

    ["圣焰隐修院"] = {
        -- BOSS部分
        ["戴尔克莱上尉"] = {
            order = 1,
            tips = "{rt8}戴尔克莱上尉{rt8}||被点名离开人群，boss的长矛会对路径上的所有人造成伤害||打断boss读条（战斗狂啸），不然会全队AOE，并且给buff小怪||BOSS找队友贴贴会带套，要打破这个套！||断狂啸，躲红线，掷矛很明显的红线不躲开必死。",
        },
        ["布朗派克男爵"] = {
            order = 2,
            tips = "{rt8}布朗派克男爵{rt8}||断灼烧，依次、轮流开减伤踩地上火堆{rt1}献祭葬火{rt1}。||远程不要站在近战区域防止{rt1}谴罚者之盾{rt1}连击||点名远程的转转锤自己看着躲。",
        },
        ["隐修院长穆普雷"] = {
            order = 3,
            tips = "{rt8}隐修院长穆普雷{rt8}||Boss会点名，地上会有一只{rt1}净涤{rt1}黄圈点谁追谁||并且黄圈还会放黑水，注意要远离人群，保持移动||BOSS半血会上楼，大伙跑楼梯追上去打掉BOSS护盾打断读条即可。||{rt1}盲目之光{rt1}时背对 Boss，躲新兵，新兵不需要打，破护盾，抽他！||心灵之火+盲目之光最好开减伤||{rt1}净涤{rt1}，可以假死、消失等技能让圈回去",
        },

    },
        ["驭雷栖巢"] = {
        -- BOSS部分
        ["凯里欧斯"] = {
            order = 1,
            tips = "{rt8}凯里欧斯{rt8}||点名分散，||BOSS激光转圈躲避||被扫到昏迷8秒，注意躲避！||五个人点名的分散圈注意加血注意分散，套圈必死||BOSS满能量了会转阶段，集合站位，有四根射线会顺时针或者逆时针旋转中了必死||射线是在空心板刷新。提前站到实心板位置||并且所有人脚下会出圈肯定要躲开的，并且BOSS会持续AOE注意边移动边加血",
        },
        ["雷卫戈伦"] = {
            order = 2,
            tips = "{rt8}雷卫戈伦{rt8}||轮流传{rt1}混沌腐蚀{rt1} Debuff，至少三人互相靠近循环，T可以吃2层。||BOSS大跳跃击||落地后产生四道往四面方向飞行的黑光柱，注意躲避||BOSS还会吸人不要被吸进圈里就好了||随机点名一个人高额的DOT时间到了会传给最近的一个人，||注意一个人不能被连续传两次不然伤害会加百分之三四百会直接暴毙，要均匀的传。",
        },
        ["虚空石畸体"] = {
            order = 3,
            tips = "{rt8}虚空石畸体{rt8}||白圈炸石头，黑水靠边放，破盾后开爆发。||别站坦克背后！BOSS召唤出来的水晶速度转火打掉！||释放腐蚀随机点名2名玩家注意驱散治疗||石头一共3个。3个DPS各炸一个，石头没炸掉基本灭团",
        },
    },
    ["燧酿酒庄"] = {
        -- BOSS部分
        ["酿造大师阿德里尔"] = {
            order = 1,
            tips = "{rt8}酿造大师阿德里尔{rt8}||醉酿投打T，预示着投掷燧酿要来了，||投掷燧酿会点名两个人高额伤害的单点需要开个减并及时躲开，||打到半血会去柜台进入无敌状态||需要有人去场地边缘给暴怒顾客送酒安抚解除无敌，注意此阶段开个减吃大红||平时站位尽量靠近BOSS，这个BOSS会随机点名一个大范围的头前，站的越近越容易躲开||地面的风躲开，会晕",
        },
        ["艾帕"] = {
            order = 2,
            tips = "{rt8}艾帕{rt8}||会召唤三只小软一直试图碰到BOSS||如果碰到会给BOSS一个非常厚的吸收盾并造成大量AOE伤害。||需要坦克拉着BOSS风筝小软||其他人控制并尽快击杀掉小软。否则变红以后移动速度加倍||{rt1}喷涌佳酿{rt1}{rt1}燃烧发酵{rt1}注意开个减。||{rt1}燃烧发酵{rt1}驱散一个奶一个",
        },
        ["本克·鸣蜂"] = {   
            order = 3,
            tips = "{rt8}本克·鸣蜂{rt8}||需要有人上蜜蜂来撞桶，桶越少越好打。||召唤小蜂蜜控住杀掉即可。||BOSS会一直召蜜蜂，注意蜜蜂刚出来没有仇恨！！！谁比T先动手就会OT猝死||蜜蜂还会随机跳人高额流血DOT注意单保||蜂蜜料汁T带着贴边放，小蜜蜂在圈里打不死需要拉开，蜜蜂条件好可以1只蜜蜂踢多个桶。",
        },
        ["戈尔迪·底爵"] = {
            order = 4,
            tips = "{rt8}戈尔迪·底爵{rt8}||场地上很多爆炸酒桶||BOSS点名坦克的击飞和点名非坦克的红圈都会引爆酒桶||产生四个方向爆炸波||利用这两个技能处理掉酒桶||否则BOSS后续大招AOE||会把所有剩余酒桶引爆造成全场伤害和满地火浪注意躲避||消大桶会叠加掉血dot，注意不要同时消桶||桶尽量消一个区域的，方便在遮天蔽日时站位。",
        },
    },
    ["暗焰裂口"] = {
        -- BOSS部分
        ["老蜡须"] = {
            order = 1,
            tips = "{rt8}老蜡须{rt8}||场地上很多小狗头人无仇恨追人||引到轨道上用矿车撞死||发红的轨道马上会来矿车。||躲Boss冲锋，被点名引小怪去铁轨让矿车撞死||不停召唤小怪的ADD战斗，小怪不需要打，靠铁轨撞就全撞死了，||BOSS会点名冲锋，冲锋路径也可以消小怪||“卑鄙诡术”是一个车必须第一时间转火打掉不然灭团。",
        },
        ["布雷炙孔"] = {
            order = 2,
            tips = "{rt8}布雷炙孔{rt8}||被点名放火的人去场地边缘点亮蜡烛||BOSS的大招AOE跑到之前点亮的蜡烛一侧就能躲掉！||被点名红圈时靠近蜡烛，点燃越多越好；Boss 吹风时站在蜡烛方向，吹灭一两个蜡烛。||{rt1}灭火强风{rt1}会熄灭蜡烛，熄灭以后会出安全场地躲避{rt1}点燃{rt1}，尽量只灭一个蜡烛。",
        },
        ["蜡烛之王"] = {
            order = 3,
            tips = "{rt8}蜡烛之王{rt8}||被BOSS点名飞刀了跑去蜡像后面档飞刀||被BOSS点名放黑圈了跑去蜡像旁边用黑圈炸掉蜡像||每轮五个蜡像尽量全部在本轮内处理完毕。||飞刀点名站在蜡像后面，身上紫圈要靠近蜡像。||BOSS会点名三个紫色大圈去框住蜡像就能消除||BOSS会恐惧{rt1}偏执失心{rt1}注意打断，||",
        },
        ["黑暗之主"] = {
            order = 4,
            tips = "{rt8}黑暗之主{rt8}||需要有人去场地边缘捡油给灯添燃，一般由中{rt1}暗影冲击{rt1}黑圈的人出去搬||BOSS点名黑圈的人要跑远几步避免黑圈炸灯||BOSS读条吹灯需要一个人把灯捡起来拿开别被吹到||BOSS读条召唤的小怪可打断需要秒断。||被点名紫圈时远离蜡烛，Boss 冲击波时搬走蜡烛，读条 AOE 时所有 DPS 出去搬蜡烛。",
        },
    },
    ["水闸行动"] = {
        -- BOSS部分
        ["席尔瓦·层烁"] = {
            order = 1,
            tips = "{rt8}席尔瓦·层烁{rt8}||小机器人会大风车并且点人追，追到了就被旋死但是吃晕控||建筑师会射钉枪钉住人并且后续有DOT伤害注意单保||扭血者会扭曲献血超高额AOE并且附带吸奶盾(重点！！！)||先打小飞机，飞机没了Boss进易伤，开SX打本体，循环即可。",
        },
        ["老大娘"] = {
            order = 2,
            tips = "{rt8}老大娘{rt8}||注意转好无人机，优先先打小飞机，||{rt1}音爆{rt1}会沉默并且推你(站的越远越好躲开)注意方向不要让放到墙上||无人机的{rt1}终极失帧{rt1}需要第一时间打断，超高额AOE附带击退||飞机没了Boss进易伤，开SX打本体，循环即可。||毁灭风暴需要多开。终极失真必须打断。",
        },
        ["齐扎·迅索"] = {
            order = 3,
            tips = "{rt8}齐扎·迅索{rt8}||双子boss必须同时死，合理利用boss点名清理完场地的炸弹||核心就是消好炸弹，消好炸弹就白给，炸弹炸了就灭团||点名红圈框住炸弹然后驱散，驱散也有高额伤害注意血线健康或者被点名的人开好减伤再驱散。||驱散越快炸飞的越低，反之越高||BOSS点名冲锋也会撞掉路上的炸弹，但是路径高额伤害注意躲开。",
        },
        ["布隆特"] = {
            order = 4,
            tips = "{rt8}布隆特{rt8}||双子boss必须同时死，合理利用boss点名清理完场地的炸弹||核心就是消好炸弹，消好炸弹就白给，炸弹炸了就灭团||点名红圈框住炸弹然后驱散，驱散也有高额伤害注意血线健康或者被点名的人开好减伤再驱散。||驱散越快炸飞的越低，反之越高||BOSS点名冲锋也会撞掉路上的炸弹，但是路径高额伤害注意躲开。",
        },
        ["沼面"] = {
            order = 5,
            tips = "{rt8}沼面{rt8}||开打之前说好往左或者往右走||开局BOSS会把人两两连接(五个人都在不会连接T)，两个人需要同手同脚不然互相拉扯，拉扯没伤害，但是这个BOSS全是地板||记住你犯错了走错了死的不止你自己还会把和你连接的队友害死||有什么躲开什么就好了，BOSS会全程高额AOE让治疗加血||铁链相连的俩人必须一点站位，躲好地板技能猛抽Boss。",
        },
        ["吉泽尔·超震"] = {
            order = 6,
            tips = "{rt8}吉泽尔·超震{rt8}||{rt1}雷霆重拳{rt1}打T超级痛并且会被击飞，这个BOSS场地是可以掉下去的，注意站位||{rt1}超力震击{rt1}会点名两个人是非常痛的高额单点，需要我们着重单保或者自己开好个减||{rt1}跃动火花{rt1}会每个人一个火花追你，追到了必死，把火花引到没有电的水上会消除掉||身上带电圈不碰水（重要，要不然晕4秒），电火花追人站水后面||{rt1}超力震击{rt1}前注意自己的圈不要圈到水||注意队友之前会互相抢水！！！。",
        },
    },
    ["伤逝剧场"] = {
        -- BOSS部分
        ["斩首者德茜雅"] = {
            order = 1,
            tips = "{rt8}斩首者德茜雅{rt8}||{rt1}通灵箭{rt1}必须打断||平时站位注意贴近BOSS不然BOSS有头前站远了躲不开||BOSS点名驱散优先驱散一个另一个注意单保会和其他技能形成combo||BOSS点名五个圈不能圈套圈注意分散并且伤害很高注意团刷.",
        },
        ["疫毒者巴瑟兰"] = {
            order = 2,
            tips = "{rt8}疫毒者巴瑟兰{rt8}||{rt1}通灵箭{rt1}必须打断||平时站位注意贴近BOSS不然BOSS有头前站远了躲不开||BOSS点名驱散优先驱散一个另一个注意单保会和其他技能形成combo||BOSS点名五个圈不能圈套圈注意分散并且伤害很高注意团刷.",
        },
        ["受诅者赛泽尔"] = {
            order = 3,
            tips = "{rt8}受诅者赛泽尔{rt8}||{rt1}通灵箭{rt1}必须打断。||平时站位注意贴近BOSS不然BOSS有头前站远了躲不开||BOSS点名驱散优先驱散一个另一个注意单保会和其他技能形成combo||BOSS点名五个圈不能圈套圈注意分散并且伤害很高注意团刷.",
        },
        ["斩血"] = {
            order = 4,
            tips = "{rt8}斩血{rt8}||注意不要中锁链( 变成腊肠 )并且小怪跳人非常痛高层一跳大半管并且跳的非常频繁||BOSS技能简单粗暴就是容易被小怪跳暴毙，但是小怪吃晕控注意做好晕控.||躲好锁链是关键",
        },
        ["无堕者哈夫"] = {
            order = 5,
            tips = "{rt8}无堕者哈夫{rt8}||战旗必须第一时间转火,层数高了战旗转不掉没位移就等死||马卓克萨斯之力超高额的AOE层数高了需要覆盖个减团减不然直接秒杀||战旗转的快随便打，转得慢大家一起死.||转到小场地的快速处理小怪并回来。",
        },
        ["库尔萨洛克"] = {
            order = 6,
            tips = "{rt8}库尔萨洛克{rt8}||BOSS打T的头前注意躲开||BOSS每轮会点名两个人两个高额单点{rt1}黑暗之井{rt1}开个减注意加好血||重点是BOSS每轮会点名五个人招五个小怪{rt1}抽取灵魂{rt1}，小怪碰到BOSS直接灭团，集合放小怪并且迅速转火.||躲好场地的球，",
        },
        ["无尽女皇莫德蕾莎"] = {
            order = 7,
            tips = "{rt8}无尽女皇莫德蕾莎{rt8}||BOSS点名五个绿圈集合的同时保持分散，出小怪给好控断迅速转掉||50%血转阶段注意高层给高个减群减||收割之镰打T很痛需要注意，T不注意会被秒杀||有啥躲啥,比较简单的BOSS但是非常考验走位",
        },
    },

    ["暴富矿区"] = {
        -- BOSS部分
        ["投币式群体打击者"] = {
            order = 1,
            tips = "{rt8}投币式群体打击者{rt8}||炸弹出来第一时间踢炸弹||注意把炸弹踢到BOSS脚下，每个人都要踢不然炸弹炸了直接灭团，炸弹会给BOSS易伤||T注意拉着走位不要让BOSS吸到场地上的金币不然会给BOSS增伤",
        },
        ["艾泽洛克"] = {
            order = 2,
            tips = "{rt8}艾泽洛克{rt8}||地震回荡注意团刷||小怪会随机盯人别被追到||艾泽里特灌注会灌注一个小怪并且小怪会持续AOE注意第一时间转火||注意躲开头前。",
        },
        ["瑞克莎·流火"] = {
            order = 3,
            tips = "{rt8}瑞克莎·流火{rt8}||{rt1}艾泽里特催化剂{rt1}贴边贴水放。||核心就是推进器冲击去消除BOSS场地上的地板就好了||中了推进器冲击注意个减注意单保(连点三次)",
        },
        ["商业大亨拉兹敦克"] = {
            order = 4,
            tips = "{rt8}商业大亨拉兹敦克{rt8}||注意点名大圈不要套人，注意单保||注意贴着BOSS，不然BOSS的加特林机关枪躲不开，很快||着重注意BOSS的两个无人机，会以它为起始往前放地板，中了必死，无人机会到处飞(重点！！！)||50%血转阶段注意消好柱子并且出两个小怪迅速转掉一个，不然治疗压力很大||中钻地猛击的尽快跑到柱子跟前炸柱子",
        },

    },

    ["麦卡贡行动"] = {
        -- BOSS部分
        ["白金拳手"] = {
            order = 1,
            tips = "{rt8}白金拳手{rt8}||注意不要踩雷就不可能有人猝死||很多地板中了伤害很低但是会把你击飞到雷上去||注意两个BOSS修好血一起死不然一个死了另一个会AOE每次AOE比上次多加20%伤害||十秒之后就是加200%伤害直接灭团。",
        },
        ["仁慈侏儒4.U.型"] = {
            order = 2,
            tips = "{rt8}仁慈侏儒4.U.型{rt8}||注意不要踩雷就不可能有人猝死||很多地板中了伤害很低但是会把你击飞到雷上去||注意两个BOSS修好血一起死不然一个死了另一个会AOE每次AOE比上次多加20%伤害||十秒之后就是加200%伤害直接灭团。",
        },
        ["狂犬K.U.-J.0."] = {
            order = 3,
            tips = "{rt8}狂犬K.U.-J.0.{rt8}||注意BOSS AOE的时候卡好箱子||BOSS点名T的DOT第一时间驱散T，驱散慢了T直接猝死||驱散了DOT会炸全团||BOSS点名三个红圈注意分散并且不要框住箱子不然箱子会变红然后爆炸||猎人等可站最远处假死让这个技能失效。",
        },
        ["首席机械师闪流"] = {
            order = 4,
            tips = "{rt8}首席机械师闪流{rt8}||盆栽，出了第一时间转火。||它会第一时间打距离它最近的目标。注意开好个减，治疗注意单保||其他的都是地板、齿轮、火线、大圈 ||有啥躲啥 就没人掉血,走位一不小心直接暴毙！。",
        },
        ["麦卡贡国王"] = {
            order = 5,
            tips = "{rt8}麦卡贡国王{rt8}||P1的单点会穿糖葫芦一键三连所以谁被点了不要站一条线上||P2会三连击点名也注意不要被穿糖葫芦||距离万磁臂越近伤害越高注意别被秒掉||T不在近战范围之内会直接灭团。",
        },
    },

    -- 11.2赛季大秘境副本
    ["塔扎维什，帷纱集市"] = {
        -- BOSS部分
        -- 琳彩天街
        ["佐·菲克斯"] = {
            order = 1,
            tips = "{rt8}佐·菲克斯{rt8}||躲开头前，躲地板，躲连线。被点名扣押违禁品的人尽快去捡自己的武器（不捡沉默，捡起来加急速）||被点名审讯的（无敌等技能可以顶掉），尽快远离BOSS。其他人尽快转火牢笼||BOSS在追踪审讯中途远离BOSS大风车。MS，奶龙可以把牢笼拉到远离BOSS的位置。",
        },
        ["佐·格伦"] = {
            order = 2,
            tips = "{rt8}佐·格伦{rt8}||开BOSS之前地上有5种乐器，推荐奶妈拿鼓，T拿中间的，DPS大爹拿【号角】||每种乐器会给小任务，点击额外按钮按照要求完成小任务可以获得急速加成。||[腐败的食品]必须躲开，中了秒杀，做乐器小任务注意不要踩到这个绿圈。||召唤的小怪传送技能注意打断或硬控，否则传送到角落放远程技能不好聚怪||[压制冲击]会把所有人往BOSS跟前拉，注意远离，被拉到跟前直接秒杀||BOSS怒吼要打断，头前要躲开。读最终警告时开嗜血打BOSS，最终警告读完没打掉有全团高额AOE||不要为了刷小游戏的急速而中地板或者头前技能。最终警告结束的AOE全员开减伤",
        },
        ["奥·麦扎"] = {
            order = 3,
            tips = "{rt8}奥·麦扎{rt8}||开BOSS之前地上有5种乐器，推荐奶妈拿鼓，T拿中间的，DPS大爹拿【号角】||每种乐器会给小任务，点击额外按钮按照要求完成小任务可以获得急速加成。||[腐败的食品]必须躲开，中了秒杀，做乐器小任务注意不要踩到这个绿圈。||召唤的小怪传送技能注意打断或硬控，否则传送到角落放远程技能不好聚怪||[压制冲击]会把所有人往BOSS跟前拉，注意远离，被拉到跟前直接秒杀||BOSS怒吼要打断，头前要躲开。读最终警告时开嗜血打BOSS，最终警告读完没打掉有全团高额AOE||不要为了刷小游戏的急速而中地板或者头前技能。最终警告结束的AOE全员开减伤",
        },
        ["P.O.S.T.总管"] = {
            order = 4,
            tips = "{rt8}P.O.S.T.总管{rt8}||[有害液体] 地板的圈尽量全部去接，接住了地板不出紫水，接完的dot可以驱散。||[邮件旋风] AOE注意抬血，[现金汇款]保证全员分担，不满员开减伤分担||[不稳定的货物]扔的炸弹，全员捡起来扔进激活的排风口（往上飘空气的），没扔进去扔到地上或者没扔完的造成全团AOE||排风口有拾取时间，注意不要吧炸弹扔到快消失的排风口。||接圈的DOT和BOSS[现金汇款]分担圈是连着放，如果没有被驱散DOT的注意开减伤分担||圈不要漏，漏了后面没地方站。炸弹一个都不能漏。",
        },
        ["阿尔克鲁克斯"] = {
            order = 5,
            tips = "{rt8}1号阿尔克鲁克斯{rt8}||[暴食]在1号BOSS时只出现在T身上，会对中debuff的人附近造成AOE伤害，1号死亡后暴食开始在队友之间开始转移释放||[饥饿之触]会把所有人拉到BOSS跟前，所有人必须被拉进去以后尽快跑出圈，没跑出来会直接秒杀||[饕餮吞噬]]会在满屏放2轮数个圆圈，需要再第一个圈出来后站到第一个圈外面||第一个圈炸了以后第二轮圈下来之前迅速走出第二个圈||[饥饿之触]施放前最好都站BOSS脚下，这样就免去了BOSS拉人进圈的阶段可以尽快的跑出圈。||1号[暴食]技能全程施放",
        },
        ["阿喀琉忒"] = {
            order = 6,
            tips = "{rt8}2号阿喀琉忒{rt8}||[]BOSS会随机点名2个人，中点名出人群，注意优先驱散近战脆皮，没被驱散的开减伤，DOT时间结束或被驱散会爆炸||[排风协议]会以BOSS为中心出白色小球，身上有[暴食]DEBUFF的人去快速吃球，可以叠加5%伤害不加治疗||其他人没有[暴食]的不要碰球，碰到一个减10%伤害。||[暴食]在时间结束时会传送到身边最近的人，[暴食]debuff会在BOSS站全程传送到1个人身上||2号[排风协议]技能的小白球在2号BOSS死亡尸体处全程释放，一般在2号块死亡时拉到角落。",
        },
        ["雯扎·金线"] = {
            order = 7,
            tips = "{rt8}3号雯扎·金线{rt8}||[歼灭螺旋]远离BOSS,拉进去秒杀。吸力越来越大，使用位移自由等可以跑出来||中[诅咒锁链]的人需要队友第一时间转火打锁链，锁链可以使用自由祝福等技能解掉。||2号的白球可以让2个DPS大爹中暴食吃球来增加伤害||BOSS血量35%会召唤下一个BOSS，T注意嘲讽新BOSS。||一般2号BOSS下场开嗜血。",
        },
        ["索·阿兹密"] = {
            order = 8,
            tips = "{rt8}索·阿兹密{rt8}||起手会放[错位斩]持续DOT,注意加血||BOSS全程会出3组6个图标柱子，站到其中一个柱子会传送到同图标的另外一个柱子||BOSS会施放逐渐扩散的漩涡，在扩散过程会根据先后顺序覆盖每个柱子，不要直接跑着穿过漩涡||需要先站到外面的柱子附近等漩涡覆盖你附近柱子同组柱子后进柱子传送到漩涡里面||BOSS会在转阶段后将场地划分为2份;4份，分割后的场地人员和技能无法穿越，需要使用传送柱子传送过去||场地分割后一般需要传送多次才能到合适的位置||[双重秘术]必须卡条打断，释放出来基本灭团||总结就是在T会传送的情况下都跟着T站柱子传送，T等队友传送后再传送。",
        },
        -- 索·莉亚的宏图
        ["希尔布兰德"] = {
            order = 9,
            tips = "{rt8}希尔布兰德{rt8}||[净化爆发]随机高额单点1-2人伤害，保证全团尽量满血，开个减||[泰坦粉碎]头前技能必须躲开||[火焰净除]同修道院尾王，被点名的人第一时间跑外场放圈，不第一时间跑基本秒杀||BOSS召唤2个小怪需要T嘲讽，小怪读防御技能必须硬断，英勇冲击也需要打断||[[定期消毒]]转阶段安排1个人去右上角控制台激活控制台||其他人按照屏幕出现的图标按颜色顺序位置把球运到对应位置的箱子。||如果BOSS转阶段完成场地的球没运完，全场秒杀。||[火焰净除]点名的注意不要把圈放到转阶段时运球的路线||转阶段后运球最好让装有WA的人去开控制台。||不会运球的人就不要去碰球，防止有人不会拿球以后傻站着不动造成团灭。||WA地址：https://wago.io/TazaveshConsole/4",
        },
        ["时空船长钩尾"] = {
            order = 10,
            tips = "{rt8}佐·格伦{rt8}||所有人集合站，BOSS会不停的从水里召唤水手，水手会追踪玩家，集中站方便聚怪，小怪吃控制||T需要移动让BOSS头前技能去打上岸的水手，头前技能T可以在释放时躲开||火炮会往脚下放圈，队伍集合以后约定移动方向统一移动躲圈||随机点名玩家把他拽向水里，防止拽到火圈或水里(水里秒杀)||随机点名2名玩家炸弹，治疗先驱脆皮，再催另外一个，驱散后有AOE不能同时驱散，炸弹会叠层数，后驱的人开减伤等驱散。||站位不合适出现漏小怪的注意控制，防止队友被追死。||驱散CD好了就驱散。同时驱散需要开团减。",
        },
        ["索·莉亚"] = {
            order = 11,
            tips = "{rt8}索·莉亚{rt8}||BOSS会召唤2个刺客，闪现出去并读条[旋风手里剑]必须打断，否则灭团||[塌缩之星]同修道院2号撞球，撞球会摊开并全团掉血。最好远程去撞球，等装球DEBUFF没了再撞下一个球||一共4个球分3次撞，第一个不撞，注意不能连撞||40%转P2，BOSS召唤5个星，然后每个人身上有箭头，需要每个人站到1个星旁边让BOSS的连线穿过星||必须五个全部穿过以后BOSS转阶段才能结束，每穿一次造成高额AOE。确保在2次内穿星完成||[能量碎片]会在刚才穿的六芒星的位置召唤满图飞镖，中飞镖秒杀||难点在于转阶段穿六芒星站位时是否能一次穿完所有六芒星。出现2次以上穿星的必须开大减定||转阶段后T第一时间拉BOSS远离六芒星附近，防止[能量碎片]没法躲。",
        },
    },


    ["奥尔达尼生态圆顶"] = {
        -- BOSS部分
        ["阿兹希卡"] = {
            order = 1,
            tips = "{rt8}阿兹希卡{rt8}||[毒性反刍]交互点2名玩家脚下出黑水，需要出外场放水。||所有玩家和T严格集合，黑圈出来不要乱动，出黑水集体移动，小怪跳过来第一时间交晕A掉。||转阶段后出现2组共6只跳人虫需要交控制或集火秒杀||被吸进圈里的小怪会给BOSS回血增伤，转阶段结束后会吸入所有存活小怪。",
        },
        ["阿瓦兹吉"] = {
            order = 2,
            tips = "{rt8}阿瓦兹吉{rt8}||紫圈被点名的2玩家靠近但避免互套，矛出现后T把BOSS带到矛中间一起顺劈。||其他人迅速出圈，圈内人注意开减伤，矛出现后优先转火打矛||[迁跃打击]每次点3名包括T奶在内的随机玩家和虚影连线，一段时间后虚影向被连线玩家冲锋,所有人躲开连线||转阶段后需要使用[迁跃打击]来冲锋BOSS消BOSS的6层护盾，冲锋6次后转正常阶段||[迁跃打击]释放有先后顺序，最先被点名的人有优先站定的权利，其他人先避让，被冲后快速走开。",
        },
        ["撰魂师"] = {
            order = 3,
            tips = "{rt8}撰魂师{rt8}||射线出来后某一条射线上的随机位置会有你的灵魂，要在BOSS读条结束前必须吃到自己灵魂。||吃完灵魂玩家也要躲开射线，否则会吃到伤害。后面可以消除小怪。||[对未知的低语]需要再保持分散的同时去吃自己的魂魄。||时转阶段时BOSS到场地中央开始引导，场地将会被分成6等分。并出3个自己的魂魄||BOSS顺时针刀劈2个区域，每次必定劈对称的两块区域，且必定顺时针劈刀。||优先吃被BOSS刀劈的魂魄，此阶段最少吃2个魂魄。||所有阶段吃一个魂魄加10%治疗伤害，被劈死魂魄减30%急速并持续掉血",
        },
    },       

    ["赎罪大厅"] = {
        -- BOSS部分
        ["哈尔吉亚斯"] = {
            order = 1,
            tips = "{rt8}哈尔吉亚斯，罪污巨像{rt8}||开场T把BOSS带到最里面放水，[投石]必须躲开。地板必须躲开||队集合一起移动(必须站BOSS圈里，出BOSS圈会掉血并无限恐惧)||BOSS只要一放水T就一直带位置，保证场地干净，站水上会掉血减速。||射线跳舞需要站在两根射线中间移动躲避，射线会变方向。",
        },
        ["艾谢朗"] = {
            order = 2,
            tips = "{rt8}艾谢朗{rt8}||[鲜血洪流]地上的圈必须躲开。全队集合，出小怪T聚好，DPS再A。||让小怪死在一个位置。小怪死亡变为石像形态后续会复活。||BOSS点名[碎石之跃]的黄圈靠近小怪死亡位置，让BOSS把小怪跳死，不然会一直复活。||[羁石诅咒]会点名玩家减速并变为石像，诅咒可以解掉。",
        },
        ["高阶裁决官阿丽兹"] = {
            order = 3,
            tips = "{rt8}高阶裁决官阿丽兹{rt8}||尽可能打断BOSS技能，躲开地上的火圈，优先驱散近战或者脆皮的DOT。||[阴森的教民点]名的人站地上容器后面，让鬼魂撞掉容器||鬼魂存在时间会全团持续AOE，中点名的注意尽快找容器消鬼魂||没容器的时候出鬼魂注意全队开减伤。||T可以吧BOSS拉到容器附近，中点名方便尽快消除鬼魂。",
        },
        ["宫务大臣"] = {
            order = 4,
            tips = "{rt8}宫务大臣{rt8}||躲地板，躲头前，躲柱子，柱子一起推开后挡线||[傲慢罪印]打T开减伤，[念力投掷]时根移动的柱子有箭头，注意躲开，撞上秒杀||起手不要站BOSS和柱子中间，BOSS拉柱子时近战远离，范围很大，拉完柱子还会反向复位。||[暗影之门]BOSS固定先推拉柱子，然后读条仪式，这时候每个柱子和BOSS中间都要站人挡线，漏线很容易灭团。||挡线以后大范围地板注意躲开",
        },
    },    
  
    ["尼鲁巴尔王宫"] = {
        ["噬灭者乌格拉克斯"] = {
            order = 1,
            tips = "{rt8}噬灭者乌格拉克斯{rt8}||被大圈标记的玩家找人分摊伤害||吃了分摊的要逃离 boss，避免被拖到 boss 下方||躲避网状物，并用绿色酸液圆圈清除它们||当能量降到 0 时，BOSS 会跳到平台中央，将所有人击退并消失进 P2||躲避 boss 冲锋，打出现的小怪||boss 出现后送它吃小怪尸体回能量进 P1",
        },
        ["血缚恐魔"] = {
            order = 2,
            tips = "{rt8}血缚恐魔{rt8}||单阶段战斗，分内外场||没事不要去血池游泳，会死||受到 Boss 吐息的可以进内场杀小怪||分两队轮流进内场||内场小怪注意打断||被 boss 点名放圈的要边跑边放||能量 100 了会大圈炸人全团跑开",
        },
        ["席克兰"] = {
            order = 3,
            tips = "{rt8}席克兰{rt8}||单阶段纯单体战斗||BOSS 会穿过玩家留下幽灵，放幽灵尽量靠近，节约场地||BOSS 点名几个玩家射光，就用光消除场地上的幽灵||幽灵消除了会留个圈，别踩",
        },
        ["拉夏南"] = {
            order = 4,
            tips = "{rt8}拉夏南{rt8}||单阶段，boss 会两边飞||BOSS 点名放绿线，看好方向躲避||绿线会变成波浪，被点名的放到边边上去||小怪拉一起打，近战位不能没人，没人会 AOE",
        },
    },


    -- 12.0 副本
    ["密谋小径"] = {
        -- BOSS部分
        ["凯斯媞亚·魔力之心"] = {
            order = 1,
            tips = "{rt8}凯斯媞亚·魔力之心{rt8}||起手优先集火法力浮龙[咬咬]，注意躲开法力浮龙的头前技能[邪能飞溅]，||该技能会在短暂蓄力（有非常明显的邪能动画特效）后边转动边引导5秒。||法力浮龙血量降至20%以下后，会反过来硬控凯BOSS并给她上100%易伤，||此时全力输出BOSS。BOSS醒了后，又会继续控制咬咬，流程跟第一段一样。||B凯斯媞亚·魔力之心召唤镜像后记得打断镜像的引导技能[邪能风暴]。",
        },
        ["赞恩·刃悲"] = {
            order = 2,
            tips = "{rt8}赞恩·刃悲{rt8}||注意走位躲圈，绿圈结束后会在场地上生成一个木桶。||当BOSS能量条充满时，它会对所有人放灭团技[绝命凶径]，此时需赶紧走位躲到桶后面。||这个灭团技会在你和BOSS之间拉一根红线，如果这根红线连到了木桶上，就说明你站的位置对了。||中点名[火焰爆炸]后靠近被邪能灌注的木桶将其摧毁，否则会它持续A全团。||能解毒的话记得解一下[断心药膏]，没有解毒职业的话，需要开减伤+治疗重点抬血。",
        },
        ["歼灭者萨祖克斯"] = {
            order = 3,
            tips = "{rt8}歼灭者萨祖克斯{rt8}||中点名[利斧投掷]远离人群，点名结束后，场地上会出现一把巨型战斧||此时需转火巨型战斧，否则它会不断A全团。||当BOSS进入[魔化狂怒]状态后，T记得把BOSS拉到场地边缘，||沿着边缘拉着BOSS走，否则BOSS会乱跑留下高额伤害地板[燃烧脚步]。",
        },
        ["利希尔·烬怒"] = {
            order = 4,
            tips = "{rt8}利希尔·烬怒{rt8}||全程远离地狱火。注意打断技能[混乱之箭]||BOSS会点名||放[古尔丹之指]，此时尽量保持靠近但不要圈套圈，点名结束后，每个人的身边会刷出很多小鬼，优先转火清掉小鬼。||BOSS放完[古尔丹之指]后，会原地开个恶魔传送门，把自己传到场地另一边，开始读灭团技[灾厄浪潮]||这个灭团技会生成一个超大范围的邪能冲击波，我们要做的就是清完小鬼后，第一时间用传送门规避冲击波。",
        },
    },
    ["风行者之塔"] = {
        -- BOSS部分
        ["烬晓"] = {
            order = 1,
            tips = "{rt8}烬晓{rt8}||中点名[赤焰腾流]出人群放地板，||BOSS读完[燃烧烈风]后，之前放的地板会被吹成火龙卷，||这期间还会有干扰走位的狂风，注意躲开。",
        },
        ["被遗弃的二人组"] = {
            order = 2,
            tips = "{rt8}被遗弃的二人组{rt8}||中点名[飞溅喷吐]出人群放地板。||被憎恶用[猛力拖拽]点名的玩家，需走位跑到女妖身后，||让憎恶用该技能拽女妖，否则会被憎恶拉过去+昏迷+吃中高额伤害。||注意修血，尽量让两个BOSS的死亡时间保持一致，||否则存活的一方会获得大幅增伤。",
        },
        ["指挥官克罗鲁科"] = {
            order = 3,
            tips = "{rt8}指挥官克罗鲁科{rt8}||BOSS大跳[无情跳跃]后，场地上会立刻出现大量落石圈，注意走位躲圈。||每当BOSS血线下降至66%和33%，会招小怪并开启99%减伤，此时需立刻转火小怪。||小怪没清干净前，BOSS会一直用[剑刃风暴]点名，近战注意走位不要靠近BOSS。||BOSS读[破胆怒吼]时，所有角色脚下会出紫圈，||立刻走位跑到离你最近的玩家旁边圈套圈，否则会被硬控。",
        },
        ["无眠之心"] = {
            order = 4,
            tips = "{rt8}无眠之心{rt8}||平时注意走位，不要碰到地上的箭矢[湍急箭矢]和幽灵电流水圈[风暴灵魂之泉]。||当BOSS引导[疾风狙击]且形成[翻腾之风]冲击波时，||踩地上的箭矢让角色飞起来规避冲击波，需等冲击波快刮到再踩。||中蓝圈点名[劲风射击]后，走位将蓝圈套到场地上的[风暴灵魂之泉]消掉，||史诗难度开嗜血速杀可略过此步骤。",
        },
    },
    ["魔导师平台"] = {
        -- BOSS部分
        ["奥能金刚库斯托斯"] = {
            order = 1,
            tips = "{rt8}奥能金刚库斯托斯{rt8}||注意躲地上的毒圈[奥术残渣]。||BOSS引导[补给协议]召唤能量宝珠时，注意去撞球，||若宝珠被BOSS吸收，会A全团并给自己20%增伤。||撞球后身上会有每跳5位数的debuff，不要吃太多球避免被跳死。",
        },
        ["瑟拉奈尔·日鞭"] = {
            order = 2,
            tips = "{rt8}瑟拉奈尔·日鞭{rt8}||中点名[符文印记]远离人群，出罩子[镇压立场]后，被点名玩家进罩子消掉印记。||BOSS读[静默浪潮]时，进罩子规避直到读完条，||站在罩子外吃该技能会被沉默8秒，罩子内仅会被沉默，出罩即解除。",
        },
        ["吉美尔鲁斯"] = {
            order = 3,
            tips = "{rt8}吉美尔鲁斯{rt8}||BOSS会召唤分身，分身拥有本体全部技能。||被点名[神经链接]的玩家，跟着箭头指引撞点名的BOSS移除链接。||注意躲开地上的黑水[虚空分泌物]。||被点名[星界束缚]的玩家，会被BOSS吸过去，注意走位往反方向跑。",
        },
        ["迪詹崔乌斯"] = {
            order = 4,
            tips = "{rt8}迪詹崔乌斯{rt8}||不要碰到场地上连着的黑线[虚空洪流]。||开打后分散站位，确保每个方向都至少有一个人。||BOSS的[不稳定的虚空精华]虚空球落地前有黑圈，需至少一人站圈里接球，||漏球会触发全团AOE和超长时间叠层debuff。||注意走位躲[贪噬之熵]发射的球，该球基本会穿过整个场地。",
        },
    },
    ["迈萨拉洞窟"] = {
        -- BOSS部分
        ["姆罗金和内克拉克斯"] = {
            order = 1,
            tips = "{rt8}姆罗金和内克拉克斯{rt8}||猎人+宠物双子BOSS，猎人先死宠物每4秒增伤20%，宠物先死猎人会读条复活，||理想状态让两个BOSS先后死亡。||宠物会随机冲锋并触发全场多处单点，注意躲圈。||猎人会放超大冰冻陷阱，平时别踩，中宠物[腐肉飞扑]点名需跑到陷阱旁踩上让宠物撞冰墓。||被猎人[弹幕射击]点名的玩家，需跑出人群单独吃伤害。",
        },
        ["沃达扎"] = {
            order = 2,
            tips = "{rt8}沃达扎{rt8}||中点名[束缚幻影]的玩家会被幻影追击，需走位让幻影与其他幻影相撞，该技能每次点四人。||躲开头前技能[寂灭]。||BOSS到中场引导[死疽融合]时，需集火打掉BOSS的盾，||同时躲好附近传送门里出现的黑球。",
        },
        ["拉克图尔，聚魂之器"] = {
            order = 3,
            tips = "{rt8}拉克图尔，聚魂之器{rt8}||中点名[粉碎灵魂]的玩家约3人，尽量离彼此近但不扎堆，||BOSS会连续跳向被点名玩家并在脚下放图腾，需尽快转火打掉图腾避免全团被A。||BOSS读[裂魂咆哮]会将所有人变灵魂形态丢到台子下，需尽快返回BOSS身边。||返程时可对光环怪用打断或硬控技能，获得移速和增伤效果。||DPS快全程仅下一次台子，慢则需要下两次。",
        },
    },
    ["纳洛拉克的洞穴"] = {
        -- BOSS部分
        ["囤宝狂人"] = {
            order = 1,
            tips = "{rt8}囤宝狂人{rt8}||注意躲头前技能[裂地强击]。||BOSS能量条满后，会往地上扔蘑菇，需走位到绿圈提示位置踩掉蘑菇。",
        },
        ["寒冬哨兵"] = {
            order = 2,
            tips = "{rt8}寒冬哨兵{rt8}||出小怪[碎裂的震颤核心]后优先转火打掉。||小怪放[碎霜]会出现圈，需走进圈里接，不接会A全团并定身所有人，漏几个圈就被A几次。||小怪被打掉后原地形成深雪，站在中间可无视场地位移效果。||BOSS引导[永恒寒冬]后会获得护盾，护盾期间会持续A全团，需开爆发快速打掉护盾。",
        },
        ["纳洛拉克"] = {
            order = 3,
            tips = "{rt8}纳洛拉克{rt8}||中点名[回响重击]后分散站位至场地边缘，点名结束会留下回响，后续点名回响也会造成伤害，需远离。||BOSS施放[压制强攻]时，躲到NPC[祖尔加拉]开的盾后面吃伤害。||回响变红时会去撞NPC[祖尔加拉]，需先一步去撞回响，||NPC每被撞一次会A全团并给所有人叠10%易伤debuff。",
        },
    },
    ["夺目谷"] = {
        -- BOSS部分
        ["光明众花"] = {
            order = 1,
            tips = "{rt8}光明众花{rt8}||开场后地面刷出三朵光明之花，被BOSS[光明之花射线]点名的玩家，||需靠近地上的花将其套进圈里，直到引导结束将花炸成[光灼大地]。",
        },
        ["圣光猎手伊库兹"] = {
            order = 2,
            tips = "{rt8}圣光猎手伊库兹{rt8}||不要靠近地上的树根[血棘之根]，否则会被定身，可转火打掉或驱散该魔法效果。||不要站在树根前，避免被BOSS[青翠践踏]击退到树根上。||被点名[嗜血注视]的玩家尽量与BOSS保持距离，||也可将BOSS往树根多的地方带，BOSS每走一步会消掉地上的树根，被逮到会受高额伤害+昏迷。",
        },
        ["护光者鲁伊亚"] = {
            order = 3,
            tips = "{rt8}护光者鲁伊亚{rt8}||BOSS开场为枭兽形态，被点名[光明之火]的玩家需远离人群。||[光明之火]结束后会从被点名玩家身边发射光明旋风，不要碰到旋风。||BOSS变熊形态后施放[凶残痛击]，治疗需快速抬满全团血量消掉debuff。||被点名[粉碎打击]的玩家要分散站位，||避免被BOSS头前冲击波重复扫到，每吃一次伤害会翻倍。",
        },
        ["兹欧凯特"] = {
            order = 4,
            tips = "{rt8}兹欧凯特{rt8}||出小怪[光诞鞭笞者]后第一时间转火打掉。||小怪快死时会进入休眠，需中点名[凝聚光线]的玩家走到休眠位置，||让BOSS将小怪彻底杀死，否则下次出小怪休眠的会满血复活。||被彻底杀死的小怪会留下[光明树脂]，记得远离。||BOSS开[光绽精华]后场地会出现超大光球，需及时跑位吃球，||BOSS吃球会A全团并给自己增伤，玩家吃球会增伤但每秒掉血，治疗需高强度团刷。",
        },
    },
    ["节点希纳斯"] = {
        -- BOSS部分
        ["核技工程长卡斯雷瑟"] = {
            order = 1,
            tips = "{rt8}核技工程长卡斯雷瑟{rt8}||中点名[回流充能]的玩家头上有蓝色箭头光标，||需走到彼此相连或交叉相连的魔网阵列线上消线。||平时注意不要背对魔网阵列线，避免被[核闪引爆]击退到线上。||其余时间地上有啥躲啥，不要穿过魔网阵列连线。",
        },
        ["核心守卫奈萨拉"] = {
            order = 2,
            tips = "{rt8}核心守卫奈萨拉{rt8}||出小怪后优先转火打掉，中点名[蚀光步伐]后分散站位。||战斗期间洛萨克森的影像会现身控住BOSS18秒，||并在其前方形成[光痕耀斑]圣光区域，站里面有大幅增伤和治疗加成但每秒掉血。||若治疗团刷给力可多站几人，不站也可。||若BOSS醒后场地还有小怪，会献祭小怪并A全团。",
        },
        ["洛萨克森"] = {
            order = 3,
            tips = "{rt8}洛萨克森{rt8}||中点名[辉熠消散]后分散站位，点名结束会原地生成BOSS镜像，||不要靠近镜像也不要站在镜像的冲锋路径上。||BOSS能量条充满后会将全团拽向自己，随后布满分身，||本体和分身的区别是分身有恶魔尖角，本体没有。||所有分身都会引导法术持续A全团，找到本体后立刻打断其引导法术即可。",
        },
    },
    ["虚空之痕竞技场"] = {
        -- BOSS部分
        ["塔兹拉尔"] = {
            order = 1,
            tips = "{rt8}塔兹拉尔{rt8}||场地中间出现黑洞[黑暗裂隙]时会吸全团，记得朝反方向跑避免被吸进去。||中点名[虚灵碎片]后与BOSS间会出现红线，||需安排另一位玩家一起挡伤害，一个人吃两次第二次会附带必死伤害。",
        },
        ["阿特洛苏斯"] = {
            order = 2,
            tips = "{rt8}阿特洛苏斯{rt8}||远离地上的绿圈[毒液喷溅]和毒水[毒池]。||躲开头前技能[毒性吐息]。||出小怪[剧毒蠕行者]后第一时间转火打掉，||该小怪会持续不断的A全团。",
        },
        ["煞戎努斯"] = {
            order = 3,
            tips = "{rt8}煞戎努斯{rt8}||BOSS会随机选两人点名[不稳定的奇点]，脚下会生成吸人的奇点，||可将两个奇点放近一点让场地更易走位。||平时不要靠近奇点，也不要背对奇点，BOSS有击退技能[宇宙冲击]。||被宝珠连线追着时，走位让线穿过奇点让宝珠撞奇点消掉，||连线会降低移速需尽快操作。||中点名[虚空奔涌]时走位离开人群，||BOSS引导结束后会朝该位置放超大宝珠，注意走位躲球。",
        },
    },

    -- 12.0 S1赛季
    ["艾杰斯亚学院"] = {
        -- BOSS部分
        ["克罗兹"] = {
            order = 1,
            tips = "{rt8}克罗兹{rt8}||阶段开始召唤大小2种鸟，小鸟点T[啄击]并流血。头领鹰隼[狂怒尖啸]AOE并给所有小鸟加攻速。[阵风]头前技能注意躲开。3波后将地上光球扔到光圈内激活BOSS。T注意点T技能[狂野啄击]，所有人躲开头前[压制狂风]。[震耳尖啸]高额AOE并打断施法，注意停手。BOSS75%和45%读条团灭技能[或灭之风]，地上刷新火圈[黄]和白圈[风]。玩家需要捡地上黄球扔到对应圈内打断BOSS施法。火圈BOSS眩晕12秒+75%易伤，会有持续AOE。风圈捡地上小白球[免疫吹风+45%急速和移速]。火圈和风圈都会在阶段内全程刷新地板圈注意躲避，提前规划先打那种圈，推荐先白圈再红圈。",
        },
        ["茂林古树"] = {
            order = 2,
            tips = "{rt8}茂林古树{rt8}||[裂树击]打T技加易伤，注意减伤和刷血。[发芽]所有人尽量集中站位并约定移动方向，围绕BOSS缓慢移动将4波小花尽量集中放置然后A掉。每两轮[发芽]后会使用[爆发苏醒]唤醒所有存活小花并超高AOE,小花会给T上毒。[分枝]随机点名玩家召唤大树，给所有玩家施加DOT，并不断读条[治疗之触]需要全程打断。大树死亡后的地板圈3秒后给所有玩家和怪物回血并移出DOT，需要玩家站在圈内把怪引到圈外。难点就是清小怪，每一次[爆发苏醒]会召唤2次小花，爆发留给每阶段第2波小花。",
        },
        ["维克萨姆斯"] = {
            order = 3,
            tips = "{rt8}维克萨姆斯{rt8}||召唤5个[奥术宝珠]飞向BOSS，BOSS吃到炸AOE+20能量,玩家吃到伤害+易伤DEBUFF。DEBUFF持续18秒，需要等DEBUFF消失后才能继续吃宝珠。[发力炸弹]随机点名3名玩家紫圈dot，4秒后放地板水，尽量放边缘。[奥数祛除]对T方向持续吐息，T站外圈开减伤。能力满释放[奥数裂隙]击飞所有玩家+超高额AOE，并连续3个秒杀地板圈，所有玩家提前开个减并躲避地板圈。",
        },
        ["多拉苟萨的回响"] = {
            order = 4,
            tips = "{rt8}多拉苟萨的回响{rt8}||BOSS所有技能施加[势不可挡]DEBUFF,3层后留下地板圈[奥术裂隙]。地板圈会发射弹幕，碰到增加DEBUFF。[释放能量]高额AOE并随机位置召唤多个[奥术裂隙]。总之躲开所有地板和弹幕，大地板圈及时跑开。",
        },
    },
    ["萨隆矿坑"] = {
        -- BOSS部分
        ["熔炉之主加弗斯特"] = {
            order = 1,
            tips = "{rt8}熔炉之主加弗斯特{rt8}||场地左右各一个熔炉，全程持续AOE，随机点名2个黄圈并召唤石头，尽量靠近不要圈套圈。[碎矿猛击]点T技需要T站到其中一个石头跟前，否则昏迷。[冰川过载]会激活最近的熔炉，所有人躲到另一个石头后面。紧接着读条[寒晶践踏]群体AOE+增伤+减速，可驱散，并摧毁剩余石头。所有的石头摧毁后会留地板水，需要地板水位置。压力在于治疗。",
        },
        ["伊克和科瑞克"] = {
            order = 2,
            tips = "{rt8}伊克和科瑞克{rt8}||开场高额AOE并召唤2个影子，注意治疗。[湮灭之箭]必须打断，影子尽量打断，影子必须1分钟内击杀。全程有大量绿水地板技需要躲开。100能量后点名玩家，被点名玩家需要尽量远离。",
        },
        ["天灾领主泰兰努斯"] = {
            order = 3,
            tips = "{rt8}天灾领主泰兰努斯{rt8}||开场有5个发光的[注能骨堆]。点名2个蓝圈DOT套住发光骨堆。[天灾君主的印记]点T并击飞，释放超大地板绿圈。T被击飞后位移躲开。所有玩家躲开不断召唤的地板绿圈[死亡之握]。大技能[亡者大军]会复活所有骨堆，正常只有一个发光骨堆召唤的特殊怪，所有玩家转火并打断。",
        },
    },
    ["通天峰"] = {
        -- BOSS部分
        ["兰吉特"] = {
            order = 1,
            tips = "{rt8}兰吉特{rt8}||[风轮]随机点名方向发射风轮出去再回来，秒杀技，注意躲开来回路径。[凝聚之风]，随机点名2个玩家，击退并在地上形成一个白圈，白圈碰到会击退。[查克拉姆漩涡]躲开场地中心的白圈，以及四周的漩涡风。难点在于漩涡阶段会有点名的风和风轮，所以最好所有人集中站在BOSS左手边，被点名风轮的人去BOSS右边。",
        },
        ["阿拉卡纳斯"] = {
            order = 2,
            tips = "{rt8}阿拉卡纳斯{rt8}||[灼热重伤]点T头前贯穿技能，并施加易伤，需要将头前放到没人的地方并躲开。场地周围会刷新不断变换位置的3条[金色射线]需要3个DPS全程挡线,漏线会给BOSS回血并增伤,治疗注意刷好DPS的血。射线结束后发射射线的机甲自爆头前技能需要及时躲开。BOSS能量达到100后会释放高额AOE，注意提前刷血交减伤，如果射线没挡完，AOE会造成团灭。难点在于DPS挡线的过程T要不断调整头前保证BOSS头前技能不要打到其他人。",
        },
        ["鲁克兰"] = {
            order = 3,
            tips = "{rt8}鲁克兰{rt8}||[燃烧之爪]点T技能，T注意减伤和刷血。[曙光]群体AOE并召唤凤凰追踪点名玩家,并持续AOE.凤凰死亡时会在8码地板伤害。凤凰每2秒损失10%的血量。被点名【远程优先】的玩家首要任务是把小凤凰带到没有其他凤凰蛋的位置，否则小凤凰会复活。每两轮召唤凤凰后BOSS会转移位置并读条团灭技能[灼热飞羽]，所有人需要躲到中央柱子后面。难点在于带小凤凰位置的人必须把小凤凰带到没有蛋的位置防止凤凰无线复活。",
        },
        ["高阶贤者维里克斯"] = {
            order = 4,
            tips = "{rt8}高阶贤者维里克斯{rt8}||[日光冲击]注意打断，[灼烧射线]随机点3名玩家持续掉血，注意刷血。[扔下]BOSS召唤小怪随机抓玩家移动到平台外面并扔掉。所有玩家转火小怪并交控制技能，在到平台外前击杀小怪，被点名玩家可提前靠墙站。[炫光]随机点名玩家追着放火焰底板，底板持续时间很长，需要注意带火的位置，不要挡住转火小怪的地方。",
        },
    },
    ["执政团之座"] = {
        -- BOSS部分
        ["晋升者祖拉尔"] = {
            order = 1,
            tips = "{rt8}晋升者祖拉尔{rt8}||点名蓝圈去边缘放水，躲开头圈，[渗透猛击]高额AOE注意开减伤，并召唤2个小软。所有人尽快转火小软，小软被BOSS吃掉会团灭，所以需要轮流减速控制。被点名玩家注意远离小软，在BOSS释放大技能吸小软时，提前留控制技能晕控所有小软。",
        },
        ["萨普瑞什"] = {
            order = 2,
            tips = "{rt8}萨普瑞什{rt8}||3子BOSS血量共享，蝙蝠怪随机点名远程跳过去并读条，必须打断。宠物怪点名[暗影突袭]高额伤害+流血必须开个减。BOSS会点名释放[虚空炸弹]，需要躲开，2轮炸弹后点蓝圈尽量圈住所有炸弹。[过载]引爆所有炸弹+易伤，所以没圈掉的炸弹需要开减伤提前踩掉。",
        },
        ["总督奈扎尔"] = {
            order = 3,
            tips = "{rt8}总督奈扎尔{rt8}||全程有3个十字门召唤飞弹注意躲避，点T技能[心灵震爆]注意打断。[虚空灌输]点名3玩家注意刷血，召唤的5个触须及时转火打掉。满能量前需要清掉触须，满能量后推开所有玩家并召唤缩小的圈，需要及时跑到BOSS跟前。",
        },
        ["鲁拉"] = {
            order = 4,
            tips = "{rt8}鲁拉{rt8}||场地有6个音符，所有音符备摧毁后BOSS进入易伤状态。起手读[绝望哀歌]高额AOE，需要预铺刷血。[深渊之枪]4秒一个裂隙，3次后打T技，注意开减伤。[裂解]召唤3条旋转射线，走位躲避，[不谐射线]的白线随机点名3名玩家，需要分别瞄准3个音符，瞄准有音效。[幽冥和音]大地板圈躲开，大地板圈的位置就是后续音符刷新位置。",
        },
    },


}


-- 调试输出
if addon.DEBUG then
    print("|cFF00FF00BossTips|r: BossData加载完成，共" .. #addon.BossData .. "个区域数据")
end